cases/2-Phasen-aleatorisch-multiRock/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       1890;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       1900;
    }
    walls
    {
        type            wall;
        nFaces          2200;
        startFace       1910;
        closedSolidBodyMotion false;
    }
)


// ************************************************************************* //
