cases/2-Phasen-aleatorisch-multiRock/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basicMultiphaseSystem;

phases (oil gas rock);

oil
{
    type            pureIsothermalPhaseModel;
    rho0            800;
    psi             0;
    mu              0.002;
    residualAlpha   1e-8;
}

gas
{
    type            pureIsothermalPhaseModel;
    rho0            20;
    psi             0;
    mu              0.001;
    residualAlpha   1e-8;
}

rock
{
    type            multiComponentPorousIsothermalPhaseModel;
    species         2(CO3 SiO3);
    rho0.SiO3       1600;
    rho0.CO3        2711;
    psi.SiO3        0;
    psi.CO3         0;   
    residualAlpha   1e-8;
}

momentum
{
    oil_relativeWith_rock
    {
        type        Darcy;
        KrModel     BrooksAndCorey;
        eta         2;
    }

    gas_relativeWith_rock
    {
        type        Darcy;
        KrModel     BrooksAndCorey;
        eta         2;
    }
}

massTransfer{}

capillarity
{

}

/*capillarity
{
    gas_relativeWith_oil
    {
        type            BrooksAndCorey;
        pc0             0.02;
        eta             0.5;
    }

/*    gas_relativeWith_oil
    {
        type            tabulated;
        scale           1e-6;
        fileName        "constant/pc1.dat";
        outOfBounds     clamp;
    }
    gas_relativeWith_oil
    {
        type            multiRockTabulated;
        porousPhase     rock;
        scale           1e-5;

        CO3
        {
            fileName        "constant/pc0.dat";
            outOfBounds     clamp;
        }
        SiO3
        {
            fileName        "constant/pc1.dat";
            outOfBounds     clamp;
        }
    }*/
}*/

// ************************************************************************* //
