cases/2-Phasen-aleatorisch-multiRock/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
();

regions
(
    // Set patch values (using ==)
    boxToCell
    {
        box (0 4 0) (1 6 1);

        fieldValues
        (
            volScalarFieldValue alpha.rock 0.95
            volScalarFieldValue alpha.oil  0.05
        );
    }
);

// ************************************************************************* //
